package ru.sber.transport.humanreadableid.model;

/**
 * Существующие префиксы.
 *
 * @deprecated использование префикса изменено на интерфейс. Это позволит вести префиксы в нескольких сервисах без
 * изменения данной библиотеки. Это перечисление будет перенесено в сервисы по использованию.
 */
@Deprecated(since = "2022-12-14")
public enum Prefix implements ru.sber.transport.humanreadableid.model.interfaces.Prefix {
    /**
     * Подразделение.
     */
    
    DT,
    
    /**
     * Сотрудник.
     */
    US,
    
    
    /**
     * Должность.
     */
    PS,
    
    /**
     * Заявки на поездки.
     */
    OT,
    
    /**
     * Заявка на лимит.
     */
    OL,
    
    /**
     * Лимит сотрудника.
     */
    LU,
    
    /**
     * Лимит подразделения.
     */
    LD,
    
    /**
     * Тариф.
     */
    TF,

    /** Заявка на подключение к корп.каршерингу */
    CR,
    
    /** Поездка на такси*/
    TT,

    /**
     * Водитель.
     */
    DR
}
