package ru.sber.transport.limits.business.model;

import java.util.UUID;

/**
 * Модель фильтрации лимитов.
 */
public interface LimitFilter {

    /**
     * Получение идентификатора организации.
     * @return идентификатор организации
     */
    UUID getOrganizationId();

    /**
     * Получение идентификатора подразделения.
     * @return идентификатор подразделения
     */
    UUID getDepartmentId();

    /**
     * Получение идентификатора сотрудника.
     * @return идентификатор сотрудника
     */
    UUID getEmployeeId();

    /**
     * Получение кода родительского подразделения.
     * @return код родительского подразделения
     */
    String getParentDepartment();

    /**
     * Получение владельца лимита
     * @return владелец лимита
     */
    String getLimitOwner();

    /**
     * Получение идентификатора лимита
     * @return идентификатор лимита
     * @deprecated нужно убрать идентификатор лимита из фильтрации, получить лимит можно более простым способом
     */
    @Deprecated(since = "4.6")
    UUID getLimitId();

    /**
     * Получение идентификатора родительского лимита
     * @return идентификатор родительского лимита
     */
    UUID getParentId();

    /**
     * Получение человекочитаемого идентификатора лимита
     * @return человекочитаемый идентификатор лимита
     */
    String getHumanReadableId();

    /**
     * Получение идентификатора запроса на пополнение лимита
     * @return идентификатор запроса на пополнение лимита
     */
    UUID getRequestId();

    /**
     * Получение года для фильтрации
     * @return год для фильтрации
     */
    Integer getYear();

    /**
     * Получение статуса для фильтрации
     * @return статус для фильтрации
     */
    Status getStatus();

    /**
     * Получение вида услуги для фильтрации
     * @return вид услуги для фильтрации
     */
    String getServiceType();

    /**
     * Получение типа лимита для фильтрации
     * @return тип лимита для фильтрации
     */
    Type getType();

    /**
     * Метод для сравнения объектов
     * @param other объект, с которым сравнивается текущий объект
     * @return результат сравнения объектов
     */
    boolean equals(Object other);

}
