-- Получение организаций, которые должны быть внутренними
-- Нужно убедиться, чтобы у них было установлено значение easup_id
select * from corporate.organization o
where o.id::text = any(array ['d89ec9a5-9c70-4eff-b672-9ce696c35bca', '37c5e6c0-24d9-4914-a230-493f5f428ec0', '5110ca66-fa90-4c9b-ba34-490c238510fe', '9c404ea0-6e68-40f3-8c39-51e8f4d1ff85',
'3eee23fd-5c1a-42a2-b62d-07e76754977b', '821619bd-14c8-49e5-bd5c-9e337bac2620', '20bcca7e-855d-4124-9266-b40bb4591618', 'e38ed255-e209-46fb-9523-7382653a5e85', '27700452-ccc2-4d98-81b6-933e5f5982db',
'42277446-b226-4e86-95a9-c29d185c1163', '8bb49ec0-437a-42c4-9e74-90f559b4a294', '75747e09-d309-48fc-9cad-f030c14ee578', 'fa69e09f-44cf-402e-b24f-97203e0aacd9']);

-- Получение организаций, которые не должны быть внутренними
select * from corporate.organization o
where o.id::text <> any(array ['d89ec9a5-9c70-4eff-b672-9ce696c35bca', '37c5e6c0-24d9-4914-a230-493f5f428ec0', '5110ca66-fa90-4c9b-ba34-490c238510fe', '9c404ea0-6e68-40f3-8c39-51e8f4d1ff85',
'3eee23fd-5c1a-42a2-b62d-07e76754977b', '821619bd-14c8-49e5-bd5c-9e337bac2620', '20bcca7e-855d-4124-9266-b40bb4591618', 'e38ed255-e209-46fb-9523-7382653a5e85', '27700452-ccc2-4d98-81b6-933e5f5982db',
'42277446-b226-4e86-95a9-c29d185c1163', '8bb49ec0-437a-42c4-9e74-90f559b4a294', '75747e09-d309-48fc-9cad-f030c14ee578', 'fa69e09f-44cf-402e-b24f-97203e0aacd9']);

-- Установление организациям, которые не должны быть внутренними, соотвествующие поля
update corporate.organization
set easup_id  = null
where id::text <> any(array ['d89ec9a5-9c70-4eff-b672-9ce696c35bca', '37c5e6c0-24d9-4914-a230-493f5f428ec0', '5110ca66-fa90-4c9b-ba34-490c238510fe', '9c404ea0-6e68-40f3-8c39-51e8f4d1ff85',
'3eee23fd-5c1a-42a2-b62d-07e76754977b', '821619bd-14c8-49e5-bd5c-9e337bac2620', '20bcca7e-855d-4124-9266-b40bb4591618', 'e38ed255-e209-46fb-9523-7382653a5e85', '27700452-ccc2-4d98-81b6-933e5f5982db',
'42277446-b226-4e86-95a9-c29d185c1163', '8bb49ec0-437a-42c4-9e74-90f559b4a294', '75747e09-d309-48fc-9cad-f030c14ee578', 'fa69e09f-44cf-402e-b24f-97203e0aacd9']);
