package ru.sber.transport.messaging.kafka.serialize;

/**
 * Режимы совместимости
 */
public enum Modes {

    /**
     * Нет проверок совместимости
     */
    NONE,

    /**
     * Консьюмер вперед. Можно удалять поля и добавлять необязательные
     */
    BACKWARD,

    /**
     * Продьюсер вперед. Можно добавлять поля и удалять необязательные
     */
    FORWARD,

    /**
     * Полная совместимость. Можно добавлять и удалять опциональные поля
     */
    FULL,

    /**
     * Консьюмер вперед. Можно удалять поля и добавлять необязательные. Совместимость со всем версиями
     */
    BACKWARD_TRANSIENT,

    /**
     * Продьюсер вперед. Можно добавлять поля и удалять необязательные. Совместимость со всем версиями
     */
    FORWARD_TRANSIENT,

    /**
     * Полная совместимость. Можно добавлять и удалять опциональные поля. Совместимость со всем версиями
     */
    FULL_TRANSIENT
}